blog/lingocloud-css-issue.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-22 Wed 14:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>解决彩云小译样式混乱问题</title>
<meta name="author" content="Siqing Mu" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">解决彩云小译样式混乱问题</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdfa5532">1. 当前使用版本：</a></li>
<li><a href="#orgc30ee5d">2. 当前使用操作系统：</a></li>
<li><a href="#org560fccf">3. 步骤</a></li>
</ul>
</div>
</div>
<p>
UPDATE: 彩云小译已在v1.0.3解决此问题
</p>

<p>
最近发现使用彩云小译扩展程序时，会将原网页样式搞得非常混乱，严重影响阅读体验。现将临时解决方案放到下方，仅供参考。
</p>

<div id="outline-container-orgdfa5532" class="outline-2">
<h2 id="orgdfa5532"><span class="section-number-2">1.</span> 当前使用版本：</h2>
<div class="outline-text-2" id="text-1">
<pre class="example" id="org6fb04e9">
彩云小译 V1.0.2 
</pre>
</div>
</div>

<div id="outline-container-orgc30ee5d" class="outline-2">
<h2 id="orgc30ee5d"><span class="section-number-2">2.</span> 当前使用操作系统：</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="org6ded3c0">
Ubuntu (Linux)
</pre>
</div>
</div>

<div id="outline-container-org560fccf" class="outline-2">
<h2 id="org560fccf"><span class="section-number-2">3.</span> 步骤</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>获取彩云小译代码放置位置</li>
</ul>
<p>
首先，右击选择Options选项，可以看到地址栏类似如下所示。（复制中间字符串，下一步会用到）
</p>
<pre class="example" id="orgc48f381">
chrome-extension://jmpepeebcbihafjjadogphmbgiffiajh/options.html
</pre>

<ul class="org-ul">
<li>打开Terminal终端，进入如下目录，后面的字符串为上一步复制所得。</li>
</ul>
<pre class="example" id="org3bb338d">
~/.config/google-chrome-beta/Default/Extensions/jmpepeebcbihafjjadogphmbgiffiajh
</pre>

<p>
MacOS 系统下所在地址
</p>
<pre class="example" id="org48f85cf">
~/Library/Application Support/Google/Chrome/Default/Extensions/jmpepeebcbihafjjadogphmbgiffiajh/1.0.2_0
</pre>

<ul class="org-ul">
<li>这时可以看到版本号文件夹目录1.0.2_0，进入后打开 tbn.js 文件，搜索如下链接并替换为#号。</li>
</ul>
<pre class="example" id="org5b2c6ce">
https://cdnjs.cloudflare.com/ajax/libs/materialize/0.97.8/css/materialize.min.css
</pre>

<ul class="org-ul">
<li>保存，完事。希望彩云小译团队在下个版本中能解决这个问题。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>
